cf_billing/InformationRegisters/энргПризнакНаличияРассрочкиАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПризнакНаличияРассрочкиАбонента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПризнакРассрочкиЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПризнакНаличияРассрочкиАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает признак наличия рассрочки абонента.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  МКД			-	СправочникСсылка.энргСтроения.
//  Абонент		-	СправочникСсылка.энргАбоненты.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьПризнакНаличияРассрочкиАбонента(Период, Организация, Район, МКД, Абонент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПризнакНаличияРассрочкиАбонента(); 
		
	Запрос.УстановитьПараметр("Период", Период); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("МКД", МКД);	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат	РезультатЗапроса;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПризнакНаличияРассрочкиАбонента()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Период КАК Период,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Организация КАК Организация,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Район КАК Район,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргПризнакНаличияРассрочкиАбонентаСрезПоследних.ПризнакРассрочкиЗадолженности КАК ПризнакРассрочкиЗадолженности
	|ИЗ
	|	РегистрСведений.энргПризнакНаличияРассрочкиАбонента.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПризнакНаличияРассрочкиАбонентаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции   

#КонецОбласти

#КонецЕсли
